Repository: quarkusio/pt.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en
Languages: pt_br

source: Another possibility is to include the `quarkus.native.additional-build-args` configuration property in your `application.properties`.
pt_br: Outra possibilidade é incluir a propriedade de configuração `quarkus.native.additional-build-args` no seu `application.properties`.

source: Another solution is to write a script to do this for you:
pt_br: Outra solução é escrever um script para fazer isso para você:

source: Any type which can be converted to one of the two previous types using Reactive Type Converters
pt_br: Qualquer tipo que possa ser convertido em um dos dois tipos anteriores usando conversores de tipo reativo

source: Apache Camel on Quarkus
pt_br: Apache Camel no Quarkus

source: Apache Cassandra Client
pt_br: Cliente Apache Cassandra

source: Apache Kafka Dev Services
pt_br: Dev Services Apache Kafka

source: Apache Kafka Reference Guide
pt_br: Guia de referência do Apache Kafka

source: Apicurio Registry Dev Services
pt_br: Dev Services Apicurio

source: Application Configuration
pt_br: Configuração da aplicação

source: Application Health & Metrics
pt_br: Métricas de integridade do aplicativo

source: Application Initialization and Termination
pt_br: Inicialização e encerramento da aplicação

source: Application class list
pt_br: Lista de classes da aplicação

source: Application requirements have changed drastically over the last few years. For any application to succeed in the era of cloud computing, Big Data, or IoT, going reactive is increasingly becoming the architecture style to follow.
pt_br: Os requisitos das aplicações mudaram drasticamente nos últimos anos. Para que qualquer aplicação tenha sucesso na era da computação em nuvem, Big Data ou IoT, tornar-se reativo está se tornando cada vez mais o estilo de arquitetura a ser seguido.

source: Arc, the dependency injection framework used by Quarkus, eliminates all the reflection calls and deduces the injection graph at build time. So, when the application starts, no expensive lookups; it’s done already!
pt_br: Arc, a estrutura de injeção de dependência usada pelo Quarkus, elimina todas as chamadas de reflexão e deduz o gráfico de injeção em tempo de compilação. Assim, quando o aplicativo é iniciado, não há pesquisas caras; já está feito!

source: Architecture
pt_br: Arquitetura

source: As a Quarkus developer, you configure the Quarkus OpenID Connect (OIDC) extension by setting the following properties in the `src/main/resources/application.properties` file.
pt_br: Como programador do Quarkus, você configura a extensão Quarkus OpenID Connect (OIDC) definindo as seguintes propriedades no diretório `src/main/resources/application.properties`.

source: As a result:
pt_br: Como resultado:

source: As for the reactive APIs exposed by Quarkus, stream manipulation uses the Mutiny API.
pt_br: Quanto às APIs reativas expostas pelo Quarkus, a manipulação de fluxo usa a API Mutiny .

source: As mentioned above, the JVM schedules the virtual threads. These virtual threads are mounted on carrier threads. The scheduling comes with a pinch of magic. When the virtual thread attempts to use blocking I/O, the JVM _transforms_ this call into a non-blocking one, unmounts the virtual thread, and mounts another virtual thread on the carrier thread. When the I/O completes, the _waiting_ virtual thread becomes eligible again and will be re-mounted on a carrier thread to continue its execution. For the user, all this dance is invisible. Your synchronous code is executed asynchronously.
pt_br: Como mencionado acima, a JVM agenda as threads virtuais. Essas threads virtuais são montadas em carrier threads. O agendamento vem com uma pitada de magia. Quando a thread virtual tenta utilizar E/S bloqueante, a JVM _transforma_ esta chamada numa chamada não bloqueante, desmonta a thread virtual e monta outra thread virtual na carrier thread. Quando a E/S é concluída, a thread virtual _em espera_ torna-se novamente elegível e será montada novamente numa carrier thread para continuar a sua execução. Para o usuário, todo esse processo é invisível. O seu código síncrono é executado de forma assíncrona.

source: As much as possible Quarkus tries to avoid reflection, reducing startup time and memory usage. During the built-time processing, extensions can analyze the application code and the classes available on the classpath and replace reflection calls with regular invocations. The usage of dynamic proxies is also prevented by using generating custom proxy at build time.
pt_br: Tanto quanto possível, o Quarkus tenta evitar a reflexão, reduzindo o tempo de inicialização e o uso de memória. Durante o processamento em tempo de compilação, as extensões podem analisar o código do aplicativo e as classes disponíveis no classpath e substituir chamadas de reflexão por chamadas regulares. O uso de proxies dinâmicos também é impedido usando a geração de proxy personalizado em tempo de compilação.

source: As much processing as possible is done at build time; thus, your application only contains the classes used at runtime. In traditional frameworks, all the classes required to perform the initial application deployment hang around for the application’s life, even though they are only used once. With Quarkus, they are not even loaded into the production JVM! Quarkus does not stop here. During the build-time processing, it prepares the initialization of all components used by your application. It results in less memory usage and faster startup time as all metadata processing has already been done.
pt_br: O máximo de processamento possível é feito em tempo de compilação; assim, seu aplicativo contém apenas as classes usadas em tempo de execução. Em estruturas tradicionais, todas as classes necessárias para executar a implantação inicial do aplicativo permanecem durante a vida útil do aplicativo, mesmo que sejam usadas apenas uma vez. Com o Quarkus, eles nem são carregados na JVM de produção! O Quarkus não para por aqui. Durante o processamento em tempo de compilação, ele prepara a inicialização de todos os componentes usados pelo seu aplicativo. Isso resulta em menos uso de memória e tempo de inicialização mais rápido, pois todo o processamento de metadados já foi feito.

source: Ask on <a href="https://stackoverflow.com/questions/tagged/quarkus">Stack Overflow with the <code>quarkus</code> tag</a>
pt_br: Pergunte no <a href="https://stackoverflow.com/questions/tagged/quarkus">Stack Overflow com a tag <code>quarkus</code></a>

source: Ask your questions on <a href="https://stackoverflow.com/questions/tagged/quarkus">Stack Overflow</a>. After the documentation, it’s probably the best place to look for answers. We actively monitor the <a href="https://stackoverflow.com/questions/tagged/quarkus">Quarkus tag</a>.
pt_br: Faça suas perguntas sobre <a href="https://stackoverflow.com/questions/tagged/quarkus">Stack Overflow</a>. Depois da documentação, é provavelmente o melhor lugar para procurar respostas. Monitoramos ativamente a <a href="https://stackoverflow.com/questions/tagged/quarkus">tag Quarkus</a>.

source: Attribute
pt_br: Atributo

source: Attribute (_alias_)
pt_br: Atributo (_alias_)

source: Authentication
pt_br: Autenticação

source: Authentication map of the client.
pt_br: Mapa de autenticação do cliente.

source: Authentication parameter of the client.
pt_br: Parâmetro de autenticação do cliente.

source: Authentication settings of the client.
pt_br: Configurações de autenticação do cliente.

source: Authorization of Web Endpoints
pt_br: Autorização de Web Endpoints

source: Automatic Service Setup with Dev Services
pt_br: Configuração automática de serviços com Dev Services

source: Automatic provisioning and application wiring of supporting services such as databases, identity servers, and more.
pt_br: Provisionamento automático e conexão de aplicações de serviços de suporte, como bancos de dados, servidores de identidade e muito mais.

source: Automatically start database containers with Dev Services.
pt_br: Inicie automaticamente contêineres de banco de dados com Dev Services.

source: Availability As Of
pt_br: Disponibilidade a partir de

source: Azure Functions (Serverless) with Vert.x Web, Servlet, or RESTEasy
pt_br: Azure Functions (Serverless) com Vert.x Web, Servlet ou RESTEasy

source: Base Runtime Image for Native Executables
pt_br: Imagem de tempo de execução base para executáveis nativos

source: Batching time period of sending messages.
pt_br: Período de tempo de envio de mensagens em lote.

source: Be Guided Through First Application
pt_br: Ser guiado na primeira aplicação

source: Be aware that it increases the compilation time... a lot (>10 minutes).
pt_br: Fique ciente de que isso aumenta significativamente o tempo de compilação... bastante (>10 minutos).

source: Because starting a Kafka broker can be long, Dev Services for Kafka uses https://vectorized.io/redpanda[Redpanda], a Kafka compatible broker which starts in ~1 second.
pt_br: Como a inicialização de um broker Kafka pode ser demorada, o Dev Services para o Kafka usa o link:https://vectorized.io/redpanda[Redpanda], um broker compatível com o Kafka que inicia em aproximadamente 1 segundo.

source: Before building a container image from the Dockerfiles shown below, you need to update the default `.dockerignore` file, as it filters everything except the `target` directory. In order to build inside a container, you need to copy the `src` directory. Thus, edit your `.dockerignore` and remove the `*` line.
pt_br: Antes de construir uma imagem de contêiner a partir dos Dockerfiles mostrados abaixo, é necessário atualizar o arquivo `.dockerignore`, uma vez que este filtra tudo exceto o diretório `target`. Para fazer o build dentro de um contêiner, é necessário copiar o diretório `src`. Portanto, edite seu `.dockerignore` e remova a linha `*`.

source: Being _deprecated_ means that this extension is likely to be replaced or removed in a future version of Quarkus.
pt_br: Ser _deprecated_ significa que essa extensão provavelmente será substituída ou removida em uma versão futura do Quarkus.

source: Below is an example of (required) additional configuration when using xDS gRPC with the Istio Service Mesh in Kubernetes.
pt_br: Abaixo está um exemplo de configuração adicional (obrigatória) ao usar xDS gRPC com o Istio Service Mesh no Kubernetes.

source: Best of Breed Libraries and Standards
pt_br: As melhores Bibliotecas e Padrões disponíveis

source: Beyond simply working, we’re aiming for Joy.
pt_br: Além de simplesmente funcionar, estamos buscando alegria.

source: Books
pt_br: Livros

source: Browse through these selections of new Quarkus related books and resources to expand your knowledge and hone your coding skills to step up your Quarkus game.
pt_br: Navegue por essas seleções de novos livros e recursos relacionados ao Quarkus para expandir seus conhecimentos e aprimorar suas habilidades de codificação para intensificar seu conhecimento em Quarkus.

source: Build Container Images
pt_br: Criar imagens de contêiner

source: Build Time Processing
pt_br: Processamento de tempo de compilação

source: Build a container image from scratch
pt_br: Criar uma imagem scratch

source: Build and Deploy
pt_br: Build e Deploy

source: Build and deploy a native Quarkus application to Kubernetes.
pt_br: Crie e implante um aplicativo nativo do Quarkus no Kubernetes.

source: Build containers for application using virtual threads
pt_br: Construir contêineres para aplicação que utiliza threads virtuais

source: Build fully static native executables
pt_br: Buildando executáveis nativos totalmente estáticos

source: Build native executables with GraalVM or Mandrel.
pt_br: Crie executáveis nativos com GraalVM ou Mandrel.

source: Build the project:
pt_br: Compile o projeto:

source: Build, Sign and Encrypt JSON Web Tokens (JWT)
pt_br: Criar, assinar e encriptar tokens Web JSON (JWT)

source: Building Applications with Gradle
pt_br: Construindo aplicativos com o Gradle

source: Building Applications with Maven
pt_br: Criando aplicativos com o Maven

source: Building My First Extension
pt_br: Construindo minha primeira extensão

source: Building Native Executables
pt_br: Criando executáveis nativos

source: Building a Native Executable
pt_br: Criando um executável nativo

source: Building fully statically linked binaries enables the usage of a https://hub.docker.com/_/scratch[scratch image] containing solely the resulting native executable.
pt_br: O build de binários totalmente linkados estaticamente permite a utilização de uma link:https://hub.docker.com/_/scratch[imagem de rascunho] contendo apenas o executável nativo resultante.

source: Building with GraalVM instead of Mandrel requires a custom builder image parameter to be passed additionally:
pt_br: Fazer o build com o GraalVM ao invés do Mandrel requer que seja passado um parâmetro adicional ao construtor da imagem:

source: Built-In Authentication Support
pt_br: Suporte de autenticação integrado

source: Business Automation
pt_br: Automação comercial

source: But you may be wondering where the URL is configured as it’s not in the code. Remember, it must not be hard-coded because the URL likely depends on the environment. The URL is configured in the application configuration:
pt_br: Mas você pode estar se perguntando onde a URL está configurada, pois não está no código. Lembre-se, ele não deve ser embutido em código porque a URL provavelmente depende do ambiente. A URL é configurada na configuração do aplicativo:

source: But, what about streams? Generating a <em>server-sent event</em> response with Quarkus is just as simple:
pt_br: Mas, e os streamings? Gerar uma resposta <em>server-sent event</em> com o Quarkus é igualmente simples:

source: By default, integration tests both *build* and *run* the native executable using the `prod` profile.
pt_br: Por padrão, os testes de integração *build* e *run* são feitos usando o profile `prod`.

source: By far the easiest way to create a container-image from your Quarkus application is to leverage one of the container-image extensions.
pt_br: A maneira mais fácil de criar uma container-image a partir da sua aplicação Quarkus é utilizar uma das extensões de imagem de contêiner.

source: CDI Integration
pt_br: Integração CDI

source: CDI Reference
pt_br: Referência CDI

source: Cache your application data
pt_br: Armazenar em cache os dados da aplicação

source: Call `native-image` with the content of file `native-image.args` as arguments. We also supply an additional argument to limit the process's maximum memory to 4 Gigabytes (this may vary depending on the project being built and the machine building it).
pt_br: Chamar `native-image` com o conteúdo do arquivo `native-image.args` como argumentos. Também fornecemos um argumento adicional para limitar a memória máxima do processo a 4 Gigabytes (isto pode variar dependendo do projeto que está sendo construído e da máquina que está sendo usada).

source: Can I write an extension?
pt_br: Posso escrever uma extensão?

source: Capabilities
pt_br: Capacidades

source: Centralized Log Management
pt_br: Gerenciamento centralizado de logs

source: Chat using <a href="https://quarkusio.zulipchat.com" target="_blank">Zulip</a> (<code>#dev</code> stream)
pt_br: Bate-papo usando <a href="https://quarkusio.zulipchat.com" target="_blank">Zulip</a> (<code>#dev</code> stream)

source: Chat using <a href="https://quarkusio.zulipchat.com/#narrow/stream/187038-dev" target="_blank">Zulip</a> (<code>#dev</code> stream)
pt_br: Bate-papo usando <a href="https://quarkusio.zulipchat.com/#narrow/stream/187038-dev" target="_blank">Zulip</a> (<code>#dev</code> stream)

source: Cheap to block
pt_br: Barato para bloquear

source: Cheap to create
pt_br: Barato para criar

source: Check out our <a href="https://github.com/quarkusio/quarkus" target="_blank">GitHub</a> for details on reporting issues and the process for submitting pull requests.
pt_br: Confira nosso <a href="https://github.com/quarkusio/quarkus" target="_blank">GitHub</a> para obter detalhes sobre como relatar problemas e o processo de envio de pull requests.

source: Check out our <a href="https://github.com/quarkusio/quarkus/discussions">GitHub Discussions</a> collaboration area to interact with other Quarkus users and developers.
pt_br: Confira nossa área de colaboração <a href="https://github.com/quarkusio/quarkus/discussions">GitHub Discussions</a> para interagir com outros usuários e desenvolvedores do Quarkus.

source: Choosing your build tool
pt_br: Escolhendo sua ferramenta de construção

source: Class Loading Reference
pt_br: Referência de carregamento de classe

source: Class Preloading
pt_br: Pré-carregamento de classes

source: Class name of authentication plugin of the client.
pt_br: Nome da classe do plugin de autenticação do cliente.

source: Client Priming
pt_br: Preparando o client

source: Client _priming_ is a technique that allows initializing a client during the snapshotting process, so it's already fully functional during the application runtime.
pt_br: Client _priming_ é uma técnica que permite inicializar um client durante o processo de _snapshotting,_ para que já esteja totalmente funcional durante o tempo de execução da aplicação.

source: Client configuration
pt_br: Configurando cliente

source: Client configuration example
pt_br: Exemplo de configuração do cliente

source: Client lookup timeout (in milliseconds).
pt_br: Tempo limite de pesquisa do cliente (em milissegundos).

source: Client operation timeout (in milliseconds).
pt_br: Tempo limite da operação do cliente (em milissegundos).

source: Clock
pt_br: Relógio

source: Clone the Git repository: `git clone {quickstarts-clone-url}`, or download an {quickstarts-archive-url}[archive].
pt_br: Clone o repositório Git: `git clone {quickstarts-clone-url}`, ou baixe um {quickstarts-archive-url}[arquivo].

source: Collecting Metrics with Micrometer
pt_br: Coletando métricas com Micrometer

source: Collecting Metrics with SmallRye Metrics
pt_br: Coletando métricas com o SmallRye Metrics

source: Combine both the familiar imperative code and the reactive style when developing applications.
pt_br: Combine o código imperativo que você já conhece e o estilo reativo ao desenvolver aplicações.

source: Combine both the familiar imperative code and the reactive style when developing applications. <a href="/continuum">Learn more</a>.
pt_br: Combine o código imperativo familiar e o estilo reativo ao desenvolver aplicativos. <a href="/continuum">Saiba mais</a>.

source: Comma separated values for configuring ack timeout MultiplierRedeliveryBackoff, min delay, max delay, multiplier.
pt_br: Valores separados por vírgulas para configurar o tempo limite do ack MultiplierRedeliveryBackoff, min delay, max delay, multiplicador.

source: Comma separated values for configuring negative ack MultiplierRedeliveryBackoff, min delay, max delay, multiplier.
pt_br: Valores separados por vírgulas para configurar o ack negativo MultiplierRedeliveryBackoff, min delay, max delay, multiplicador.

source: Command Line Applications
pt_br: Aplicativos de linha de comando

source: Command Line Interface
pt_br: Interface da linha de comandos

source: Command Mode Reference
pt_br: Referência do modo de comando

source: Community and Standards
pt_br: Comunidade e Padrões

source: Compatibility
pt_br: Compatibilidade

source: Compiling Quarkus application using virtual threads into native executable
pt_br: Compilando a aplicação Quarkus utilizando threads virtuais num executável nativo

source: Compiling fully static binaries is done by statically linking https://musl.libc.org/[musl] instead of `glibc` and should not be used in production without rigorous testing.
pt_br: A compilação de binários totalmente estáticos é feita através de um link estático com o link:https://musl.libc.org/[musl] em vez de `glibc` e não deve ser usada em produção sem testes rigorosos.

source: Compiling the application to a native executable
pt_br: Compilar a aplicação para um executável nativo

source: Components
pt_br: Componentes

source: Compress Native Executables with UPX
pt_br: Compactar executáveis nativos com UPX

source: Compress native images
pt_br: Compactar imagens nativas

source: Computing the class list
pt_br: Calculando a lista de classes

source: Conditional Extension Dependencies
pt_br: Dependências de extensão condicional

source: Config file
pt_br: Arquivo de configuração

source: Configuration Reference
pt_br: Referência de configuração

source: Configure storing of Quarkus transaction logs in a database
pt_br: Configurar o armazenamento dos registos de transacções do Quarkus numa base de dados

source: Configure the Redis backend
pt_br: Configurar o Redis para uso no backend do cache

source: Configure the Redis key
pt_br: Configurar a chave Redis

source: Configure the default `datacontenttype` attribute of the outgoing Cloud Event. Requires `cloud-events` to be set to `true`. This value is used if the message does not configure the `datacontenttype` attribute itself Type: _string_
pt_br: Configura o atributo 'datacontenttype' padrão do evento de nuvem de saída. Requer que 'cloud-events' seja definido como 'true'. Esse valor será usado se a mensagem não configurar o próprio atributo 'datacontenttype' Tipo: _string_

source: Configure the default `dataschema` attribute of the outgoing Cloud Event. Requires `cloud-events` to be set to `true`. This value is used if the message does not configure the `dataschema` attribute itself Type: _string_
pt_br: Configura o atributo 'dataschema' padrão do evento de nuvem de saída. Requer que 'cloud-events' seja definido como 'true'. Esse valor será usado se a mensagem não configurar o próprio atributo 'dataschema' Tipo: _string_

source: Configure the default `source` attribute of the outgoing Cloud Event. Requires `cloud-events` to be set to `true`. This value is used if the message does not configure the `source` attribute itself Type: _string_
pt_br: Configure o atributo 'source' padrão do evento de nuvem de saída. Requer que 'cloud-events' seja definido como 'true'. Esse valor será usado se a mensagem não configurar o próprio atributo 'source' Tipo: _string_

source: Configure the default `subject` attribute of the outgoing Cloud Event. Requires `cloud-events` to be set to `true`. This value is used if the message does not configure the `subject` attribute itself Type: _string_
pt_br: Configure o atributo 'subject' padrão do evento de nuvem de saída. Requer que 'cloud-events' seja definido como 'true'. Esse valor será usado se a mensagem não configurar o próprio atributo 'subject' Tipo: _string_

source: Configure the default `type` attribute of the outgoing Cloud Event. Requires `cloud-events` to be set to `true`. This value is used if the message does not configure the `type` attribute itself Type: _string_
pt_br: Configure o atributo 'type' padrão do evento de nuvem de saída. Requer que 'cloud-events' seja definido como 'true'. Esse valor será usado se a mensagem não configurar o próprio atributo 'type' Tipo: _string_

source: Configure the runtime environment. Set `GRAALVM_HOME` environment variable to the GraalVM installation directory, for example:
pt_br: Configurar o runtime environment. Defina a variável de ambiente `GRAALVM_HOME` para o diretório de instalação do GraalVM, por exemplo:

source: Configuring GraalVM
pt_br: Configurando a GraalVM

source: Configuring Kafka topics
pt_br: Configurando os tópicos no Kafka

source: Configuring Logging
pt_br: Configurando o registro em log

source: Configuring Well-Known OpenID Connect (OIDC) Providers
pt_br: Configurando provedores conhecidos do OpenID Connect (OIDC)

source: Configuring Your Application
pt_br: Configurar a sua aplicação

source: Configuring for production
pt_br: Configuração para produção
